# CADLinkOperations Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CADLinkOperations Properties
CADLinkOperations Class See Also
---
The CADLinkOperations type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from LinkOperations.) |

# See Also
CADLinkOperations Class
Autodesk.Revit.DB Namespace